# EDA - CUSTOMER SEGMENTATION DATASET

About the dataset:

Link: https://www.kaggle.com/datasets/muhammadhussnain09/customer-behaviour-dataset/data

Info: This dataset contains 350 customer records with a mix of numerical and categorical features. It includes demographics, spending behavior, and product preferences, making it suitable for unsupervised learning and customer segmentation tasks.

## Libraries and data

In [2]:
# Libraries

import pandas as pd

In [3]:
# Data

PATH_FILE = "/home/gustavo/repos/pandas_specialization/data/customer_segmentation_mixed.csv"
dataset = pd.read_csv(PATH_FILE)

## Inspecting dataset

In [5]:
dataset.head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
0,56,26102,85,6,Female,Clothing
1,46,70336,75,18,Male,Home
2,32,105314,36,10,Male,Groceries

In [6]:
dataset.tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
347,50,42700,77,19,Male,Clothing
348,38,54620,3,6,Female,Electronics
349,49,40559,33,2,Male,Clothing

In [8]:
dataset.info()

<class 'pandas.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                350 non-null    int64
 1   Annual_Income      350 non-null    int64
 2   Spending_Score     350 non-null    int64
 3   Monthly_Visits     350 non-null    int64
 4   Gender             350 non-null    str
 5   Preferred_Product  350 non-null    str
dtypes: int64(4), str(2)
memory usage: 16.5 KB

In [9]:
dataset.shape

(350, 6)

## Sorting for insights

In [ ]:
# Visualización organizando la columna 'Age'

dataset.sort_values("Age").head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
252,18,84895,15,5,Male,Home
265,18,47192,13,19,Male,Sports
134,18,114758,51,9,Female,Electronics

In [ ]:
# Visualización organizando las columnas 'Age' y 'Annual_Income', en forma descendente y acendente

dataset.sort_values(["Age", "Annual_Income"], ascending=[False, True]).head(5)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
326,64,23709,26,17,Male,Groceries
51,64,70300,35,19,Female,Sports
55,64,76661,47,1,Male,Electronics
34,64,90316,60,9,Male,Sports
84,64,93847,92,10,Male,Electronics

In [ ]:
# Visualización organizando la columna 'Age', y mostrando las últimas tres filas

dataset.sort_values("Age").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
51,64,70300,35,19,Female,Sports
55,64,76661,47,1,Male,Electronics
34,64,90316,60,9,Male,Sports

In [ ]:
# Visualización organizando la columna "Annual_Income" y mostrando las tres primeras filas

dataset.sort_values("Annual_Income").head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
202,20,20412,21,7,Male,Groceries
236,20,20728,90,7,Male,Groceries
266,29,21062,84,17,Female,Clothing

In [ ]:
# Visualización organizando la columna "Annual_Income" y mostrando las tres últimas filas

dataset.sort_values("Annual_Income").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
339,52,119518,47,10,Female,Clothing
18,41,119713,57,3,Male,Sports
340,58,119835,1,7,Male,Clothing

In [ ]:
# Visualización organizando las columnas "Monthly_Visits" y "Spending_Score", en forma ascendente y descendente, y finalmente mostrando las 10 primeras filas

dataset.sort_values(["Monthly_Visits", "Spending_Score"], ascending=[True, False]).head(10)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
79,57,114476,99,1,Female,Clothing
140,26,43049,98,1,Male,Sports
336,46,100219,97,1,Female,Sports
87,42,48251,95,1,Male,Clothing
220,21,79031,94,1,Female,Sports
189,54,108668,93,1,Female,Clothing
53,61,75609,82,1,Male,Groceries
57,31,90313,66,1,Female,Home
120,41,113468,65,1,Male,Home
320,44,35485,62,1,Female,Groceries

In [ ]:
# Visualización organizada de la columna "Monthly_Visits", mostrando las tres últimas filas

dataset.sort_values("Monthly_Visits").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
40,26,111083,27,19,Female,Sports
323,47,24748,79,19,Female,Sports
347,50,42700,77,19,Male,Clothing

## Select columns

In [26]:
Age_Gender_Product = dataset[["Age", "Gender", "Preferred_Product"]]
Age_Gender_Product.head(5)

   Age  Gender Preferred_Product
0   56  Female          Clothing
1   46    Male              Home
2   32    Male         Groceries
3   60  Female       Electronics
4   25    Male       Electronics

## Subsetting rows

In [ ]:
# Visualización de las filas de "Annual_Income" con valores menores a 25000. Organizadas por la misma columan de forma ascendente

dataset[dataset['Annual_Income']<25000].sort_values("Annual_Income", ascending=True)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
202,20,20412,21,7,Male,Groceries
236,20,20728,90,7,Male,Groceries
266,29,21062,84,17,Female,Clothing
94,42,21150,74,8,Female,Home
308,34,21324,24,19,Female,Home
286,52,21542,59,6,Female,Sports
35,61,22368,50,5,Female,Sports
65,21,23051,96,19,Female,Electronics
196,49,23267,5,18,Female,Sports
106,52,23343,62,5,Female,Electronics
181,30,23373,4,19,Female,Groceries
326,64,23709,26,17,Male,Groceries
170,61,24000,66,18,Male,Sports
11,41,24014,15,5,Male,Clothing
153,56,24611,30,9,Female,Clothing
323,47,24748,79,19,Female,Sports